// 1. Вивести в консоль всі цілі числа від 1 до 100
for (let i = 1; i <= 100; i++) {
    console.log(i);
}

// 2. Вивести в консоль всі цілі числа від -100 до 0
for (let i = -100; i <= 0; i++) {
    console.log(i);
}

// 3. Вивести в консоль всі цілі числа від 100 до 1
for (let i = 100; i > 0; i--) {
    console.log(i);
}

// 4. Вивести в консоль всі парні числа від 1 до 100
for (let i = 1; i <= 100; i++) {
    if ( i % 2 === 0) {
        console.log(i);
    }
}

// 5. Вивести в консоль всі числа кратні 3 від 1 до 100
for (let i = 1; i <= 100; i++) {
    if ( i % 3 === 0) {
        console.log(i);
    }
}